{
	"@metadata": {
		"authors": [
			"FF-11",
			"FF11"
		]
	},
	"apihelp-wikilambda_fetch-summary": "Holt das JSON-Modell von ZObjects.",
	"apihelp-wikilambda_fetch-param-zids": "Holt das JSON-Modell von ZObjects.",
	"apihelp-wikilambda_fetch-param-language": "Die Sprache, in der die Ergebnisse zurückgegeben werden sollen.",
	"apihelp-wikilambda_fetch-example-single": "Holt ein einzelnes ZObjekt, Z1.",
	"apihelp-wikilambda_fetch-example-multiple": "Holt drei ZObjects: Z1, Z2, und Z3.",
	"apierror-wikilambda_fetch-missingzid": "Die angegebene ZID „$1“ existiert nicht in diesem Wiki.",
	"apihelp-wikilambda_function_call-param-zobject": "ZObject für Funktionsaufruf",
	"apihelp-wikilambda_function_call-example-if": "Aufruf von Z802 (If) mit falschem Vorzeichen.",
	"apihelp-wikilambda_function_call-example-native-code": "Aufrufen von nativem Code",
	"apihelp-wikilambda_function_call-summary": "Aufrufen einer Funktion durch Aufruf des Funktions-Orchestrators",
	"apihelp-query+wikilambdasearch_labels-summary": "Mit diesem API-Abfragelistengenerator kannst du ZObjects nach Bezeichnungen in einer bestimmten Sprache durchsuchen. Er dient in erster Linie zur Unterstützung des Look-Ahead-Suchsystems.",
	"apihelp-query+wikilambdasearch_labels-param-search": "Der Suchbegriff",
	"apihelp-query+wikilambdasearch_labels-param-language": "Der MediaWiki-Sprachcode, in dem gesucht werden soll",
	"apihelp-query+wikilambdasearch_labels-param-nofallback": "Ob nur in der angegebenen Sprache und nicht in den Fallback-Sprachen gesucht werden soll",
	"apihelp-query+wikilambdasearch_labels-param-exact": "Ob nach exakten Übereinstimmungen gesucht werden soll. Wenn diese Option deaktiviert ist, wird die Eingabe als eine von Groß- und Kleinschreibung unabhängige, Unicode-normalisierte Suche verwendet, wobei Akzente auf lateinischen Zeichen ignoriert werden.",
	"apihelp-query+wikilambdasearch_labels-param-type": "Schränkt Übereinstimmungen auf einen bestimmten Typ von ZObject ein.",
	"apihelp-query+wikilambdasearch_labels-param-limit": "Die maximale Anzahl von Ergebnissen, die zurückgegeben werden sollen",
	"apihelp-query+wikilambda-example-simple": "Suche nach ZObjects, deren Bezeichnung „foo“ auf Englisch übereinstimmt",
	"apihelp-query+wikilambda-example-nofallback": "Sucht nach ZObjects, deren Bezeichnung mit „foo“ auf Französisch übereinstimmt, und akzeptiert keine Fallback-Sprachen",
	"apihelp-query+wikilambda-example-type": "Suche nach ZObjects vom Typ „Z4“, Rückgabe von englischen Bezeichnungen",
	"apihelp-query+wikilambdaload_zobjects-summary": "Sucht ZObjects anhand ihrer ZIDs und gibt ihr JSON-Modell vollständig oder gefiltert nach einer bestimmten Sprache oder Fallbacks zurück. Wenn eine der angegebenen ZIDs nicht im Wiki vorhanden ist, wird ein Z5-Fehler anstelle des angeforderten ZObjects zurückgegeben.",
	"apihelp-query+wikilambdaload_zobjects-param-zids": "Die abzurufenden ZObject ZIDs, getrennt durch Pipes.",
	"apihelp-query+wikilambdaload_zobjects-param-language": "Der MediaWiki-Sprachcode, in dem alle ZObject-Labesl ausgegeben werden sollen.",
	"apihelp-query+wikilambdaload_zobjects-param-canonical": "Ob die kanonische Form oder, wenn deaktiviert, die teilnormale Form der angeforderten ZObjects zurückgegeben werden soll. Diese Teilnormalisierung schließt ZLists, ZMonolingual Strings und ZMultilingual Strings aus.",
	"apihelp-query+wikilambdaload_zobjects-example-full": "Suche nach den ZObjects Z12 und Z4 und gib deren vollständige JSON-Repräsentation zurück.",
	"apihelp-query+wikilambdaload_zobjects-example-language": "Suche nach den ZObjects Z12 und Z4 und gib deren Labels gefiltert nach Spanisch oder Fallback-Sprachen zurück.",
	"apihelp-query+wikilambdaload_zobjects-example-error": "Suche nach den ZObjects Z1 und dem nicht existierenden Z0123456789 und gib deren vollständige JSON-Repräsentation zurück.",
	"apihelp-query+wikilambdaload_zobjects-example-canonical": "Sucht nach dem ZObject Z12 und gibt dessen kanonische JSON-Darstellung zurück.",
	"apihelp-wikilambda_edit-example-create": "Erzeugt ein neues ZObjekt vom Typ Z6, mit dem Wert „value“ und der Beschriftung „label“",
	"apihelp-wikilambda_edit-example-edit-incorrect": "Versuch, das ZObjekt Z010 mit falschen Daten zu aktualisieren",
	"apihelp-wikilambda_edit-summary": "Erstellt oder bearbeitet ein ZObjekt.",
	"apihelp-wikilambda_edit-param-summary": "Zusammenfassende Meldung bearbeiten",
	"apihelp-wikilambda_edit-param-zid": "ZID des zu bearbeitenden ZObjekts. Wenn null, wird das ZObjekt neu erstellt",
	"apihelp-wikilambda_edit-param-zobject": "JSON-Repräsentation des zu speichernden ZObjects",
	"apierror-wikilambda_function_call-not-connected": "Konnte Host <$1> nicht auflösen, wahrscheinlich weil der Orchestrator nicht läuft. Bitte lies in der README nach, um den Orchestrator zu einer docker-compose-Konfiguration hinzuzufügen.",
	"apierror-wikilambda_edit-invalidjson": "Konnte ZObject für gegebene Eingabe „$1“ nicht erstellen; ungültiges JSON.",
	"apierror-wikilambda_edit-unmatchingzid": "Der Parameter ZID „$1“ stimmt nicht mit der ZObject ID „$2“ überein"
}
