{
	"@metadata": {
		"authors": [
			"Brettchenweber",
			"ElBe",
			"FF-11",
			"FF11",
			"McDutchie"
		]
	},
	"apihelp-wikilambda_fetch-summary": "Holt das JSON-Modell von ZObjects.",
	"apihelp-wikilambda_fetch-param-zids": "Die abzurufenden ZObject-ZIDs.",
	"apihelp-wikilambda_fetch-param-revisions": "Die Versionen der relevanten ZIDs zum Abrufen. Wenn nicht gesetzt, werden die neuesten Versionen abgerufen.",
	"apihelp-wikilambda_fetch-param-language": "Die Sprache, in der die Ergebnisse zurückgegeben werden sollen.",
	"apihelp-wikilambda_fetch-example-single": "Holt ein einzelnes ZObjekt, Z1.",
	"apihelp-wikilambda_fetch-example-single-old": "Abrufen der Version 12 eines einzelnen ZObject, Z1.",
	"apihelp-wikilambda_fetch-example-multiple": "Holt drei ZObjects: Z1, Z2, und Z3.",
	"apihelp-wikilambda_fetch-example-multiple-old": "Holen von Version 12 von ZObject Z1, Version 14 von Z2 und Version 25 von Z3.",
	"apierror-wikilambda_fetch-missingzid": "Die angegebene ZID „$1“ existiert nicht in diesem Wiki.",
	"apihelp-wikilambda_function_call-param-zobject": "ZObject für Funktionsaufruf",
	"apihelp-wikilambda_function_call-example-generic-list": "Aufrufen einer Funktion, die das erste Element einer typisierten Liste zurückgibt",
	"apihelp-wikilambda_function_call-example-generic-pair": "Aufrufen einer Funktion, die das zweite Element eines Paares <String,Pair<String,Bool>> zurückgibt",
	"apihelp-wikilambda_function_call-example-generic-map": "Aufrufen einer Funktion, die das Element einer generischen Map an einem bestimmten Schlüssel auf eine String-Version seines Wertes abbildet",
	"apihelp-wikilambda_function_call-example-user-defined-generic-type": "Erzeugen eines Z4/Typs mit einer benutzerdefinierten Funktion und Verwendung dieses Z4/Typs als Z1K1/Typ eines ZObjekts",
	"apihelp-wikilambda_function_call-example-composition": "Aufrufen einer Zusammenstellung: Wenn das erste Argument wahr ist, sortiere das zweite; sonst gib es unberührt zurück",
	"apihelp-wikilambda_function_call-example-notempty": "Ruft die „not empty“-Funktion als Komposition auf: gibt true zurück, wenn die Eingabeliste mindestens ein Element enthält",
	"apihelp-wikilambda_function_call-example-map": "Aufrufen der Map-Funktion: gegeben eine Funktion und eine Liste von Zeichenketten, wird das Ergebnis der Ausführung der Funktion über jede Zeichenkette zurückgegeben",
	"apihelp-wikilambda_function_call-example-apply": "Aufrufen der Funktion Apply: Eine Funktion und eine Zeichenkette geben das Ergebnis der Ausführung der Funktion über die Zeichenkette zurück",
	"apihelp-wikilambda_function_call-example-if": "Aufruf vom eingebauten Z802 (If) mit falschem Vorzeichen.",
	"apihelp-wikilambda_function_call-example-native-js-code": "Aufrufen von selbst geschriebenem JavaScript-Code",
	"apihelp-wikilambda_function_call-example-native-python-code": "Aufrufen von selbst geschriebenem JavaScript-Code",
	"apihelp-wikilambda_function_call-example-user-defined-python": "Aufrufen einer Python-Funktion mit einem benutzerdefinierten Typ.",
	"apihelp-wikilambda_function_call-example-user-defined-javascript": "Aufrufen einer JavaScript-Funktion mit einem benutzerdefinierten Typ.",
	"apihelp-wikilambda_function_call-example-user-defined-validation": "Aufrufen einer benutzerdefinierten, in Python implementierten Validierungsfunktion",
	"apihelp-wikilambda_function_call-example-curry": "Aufrufen einer Currying-Funktion",
	"apihelp-wikilambda_function_call-example-timeout": "Aufrufen einer Funktion, die versucht, ewig zu laufen, und deshalb im Evaluator eine Zeitüberschreitung verursacht",
	"apihelp-wikilambda_function_call-example-orchestrator-timeout": "Aufrufen einer Funktion, die im Orchestrator zu lange läuft und deshalb eine Zeitüberschreitung verursacht",
	"apihelp-wikilambda_function_call-summary": "Aufrufen einer Funktion durch Aufruf des Funktions-Orchestrators",
	"apihelp-wikilambda_health_check-summary": "Führe eine Zustandsprüfung für den Wikilambda-Endpunkt durch",
	"apihelp-query+wikilambdasearch_labels-summary": "Mit diesem API-Abfragelistengenerator kannst du ZObjects nach Bezeichnungen in einer bestimmten Sprache durchsuchen. Er dient in erster Linie zur Unterstützung des Look-Ahead-Suchsystems.",
	"apihelp-query+wikilambdasearch_labels-param-search": "Der Suchbegriff",
	"apihelp-query+wikilambdasearch_labels-param-language": "Der MediaWiki-Sprachcode, in dem gesucht werden soll",
	"apihelp-query+wikilambdasearch_labels-param-nofallback": "Ob nur in der angegebenen Sprache und nicht in den Fallback-Sprachen gesucht werden soll",
	"apihelp-query+wikilambdasearch_labels-param-exact": "Ob nach exakten Übereinstimmungen gesucht werden soll. Wenn diese Option deaktiviert ist, wird die Eingabe als eine von Groß- und Kleinschreibung unabhängige, Unicode-normalisierte Suche verwendet, wobei Akzente auf lateinischen Zeichen ignoriert werden.",
	"apihelp-query+wikilambdasearch_labels-param-type": "Schränkt Übereinstimmungen auf einen bestimmten Typ von ZObject ein.",
	"apihelp-query+wikilambdasearch_labels-param-return_type": "Schränkt Übereinstimmungen auf ZFunktionen ein, die den angegebenen Typ zurückgeben können, einschließlich solcher, die ein generisches ZObject zurückgeben.",
	"apihelp-query+wikilambdasearch_labels-param-strict_return_type": "Beschränkung des Rückgabetyps auf den angegebenen Typ, ausgenommen generisches ZObject",
	"apihelp-query+wikilambdasearch_labels-param-limit": "Die maximale Anzahl von Ergebnissen, die zurückgegeben werden sollen",
	"apihelp-query+wikilambda-example-simple": "Suche nach ZObjects, deren Bezeichnung mit „foo“ auf Englisch übereinstimmt",
	"apihelp-query+wikilambda-example-nofallback": "Sucht nach ZObjects, deren Bezeichnung mit „foo“ auf Französisch übereinstimmt, und akzeptiert keine Fallback-Sprachen",
	"apihelp-query+wikilambda-example-type": "Suche nach ZObjects vom Typ „Z4“, Rückgabe von englischen Bezeichnungen",
	"apihelp-query+wikilambda-example-return-type": "Suche nach ZObjects des Rückgabetyps „Z40“ oder „Z1“, Rückgabe englischer Bezeichnungen",
	"apihelp-query+wikilambda-example-strict-return-type": "Suche nach ZObjects mit Rückgabetyp „Z40“, Rückgabe englischer Bezeichnungen",
	"apihelp-query+wikilambdaload_zobjects-summary": "Sucht ZObjects anhand ihrer ZIDs und gibt ihr JSON-Modell vollständig oder gefiltert nach einer bestimmten Sprache oder Fallbacks zurück. Wenn eine der angegebenen ZIDs nicht im Wiki vorhanden ist, wird ein Z5-Fehler anstelle des angeforderten ZObjects zurückgegeben.",
	"apihelp-query+wikilambdaload_zobjects-param-zids": "Die abzurufenden ZObject-ZIDs.",
	"apihelp-query+wikilambdaload_zobjects-param-language": "Der MediaWiki-Sprachcode, in dem alle ZObject-Labesl ausgegeben werden sollen.",
	"apihelp-query+wikilambdaload_zobjects-param-canonical": "Ob die kanonische Form oder, wenn deaktiviert, die teilnormale Form der angeforderten ZObjects zurückgegeben werden soll. Diese Teilnormalisierung schließt ZLists, ZMonolingual Strings und ZMultilingual Strings aus.",
	"apihelp-query+wikilambdaload_zobjects-example-full": "Suche nach den ZObjects Z12 und Z4 und gib deren vollständige JSON-Repräsentation zurück.",
	"apihelp-query+wikilambdaload_zobjects-example-language": "Suche nach den ZObjects Z12 und Z4 und gib deren Labels gefiltert nach Spanisch oder Fallback-Sprachen zurück.",
	"apihelp-query+wikilambdaload_zobjects-example-error": "Suche nach den ZObjects Z1 und dem nicht existierenden Z0123456789 und gib deren vollständige JSON-Repräsentation zurück.",
	"apihelp-query+wikilambdaload_zobjects-example-canonical": "Sucht nach dem ZObject Z12 und gibt dessen kanonische JSON-Darstellung zurück.",
	"apierror-query+wikilambdaload_zobjects-unloadable": "ZObjectStore konnte die Seite für „$1“ nicht laden.",
	"apierror-query+wikilambdaload_zobjects-notzobject": "ZObjectStore lud ein Nicht-ZObjekt für „$1“.",
	"apihelp-wikilambda_edit-example-create": "Erzeugt ein neues ZObjekt vom Typ Z6, mit dem Wert „value“ und der Beschriftung „label“",
	"apihelp-wikilambda_edit-example-edit-incorrect": "Versuch, das ZObjekt Z010 mit falschen Daten zu aktualisieren",
	"apihelp-wikilambda_edit-summary": "Erstellt oder bearbeitet ein ZObjekt.",
	"apihelp-wikilambda_edit-param-summary": "Zusammenfassende Meldung bearbeiten",
	"apihelp-wikilambda_edit-param-zid": "ZID des zu bearbeitenden ZObjekts. Wenn null, wird das ZObjekt neu erstellt",
	"apihelp-wikilambda_edit-param-zobject": "JSON-Repräsentation des zu speichernden ZObjects",
	"apierror-wikilambda_function_call-not-connected": "Konnte Host „$1“ nicht auflösen, wahrscheinlich weil der Orchestrator nicht läuft. Bitte lies in der README nach, um den Orchestrator zu einer docker-compose-Konfiguration hinzuzufügen.",
	"apierror-wikilambda_function_call-concurrency-limit": "Du hast zu viele Funktionsaufrufe, die im Moment ausgeführt werden.",
	"apierror-wikilambda_edit-invalidjson": "Konnte ZObject für gegebene Eingabe „$1“ nicht erstellen; ungültiges JSON.",
	"apierror-wikilambda_edit-unmatchingzid": "Der Parameter ZID „$1“ stimmt nicht mit der ZObject ID „$2“ überein",
	"apihelp-query+wikilambdafn_search-summary": "Diese API-Abfrageliste sucht nach den IDs aller ZObjects, die einer bereitgestellten ZFunction-ID zugeordnet sind",
	"apihelp-query+wikilambdafn_search-example-simple": "Suchen nach ZImplementation-IDs, die einer bestimmten ZFunction-ID zugeordnet sind",
	"apihelp-query+wikilambdafn_search-param-zfunction_id": "Die ZFunktion-ID, nach der gesucht werden soll",
	"apihelp-query+wikilambdafn_search-param-type": "Der Typ des ZObjects, das von der ZFunction referenziert wird und nach dem gesucht werden soll",
	"apierror-wikilambda_perform_test-not-connected": "Host „$1“ konnte nicht aufgelöst werden, wahrscheinlich weil der Orchestrator nicht läuft. Bitte lies das README, um den Orchestrator zu deiner docker-compose-Konfiguration hinzuzufügen.",
	"apihelp-wikilambda_perform_test-example": "Durchführung von Tests gegen eine vollständig bereitgestellte ZF-Funktion, ZImplementierung und ZTester",
	"apihelp-wikilambda_perform_test-summary": "Endpunkt zur Abfrage von Testergebnissen für eine ZFunktion. Akzeptiert eine ZFunktion, eine Liste von ZImplementierungen und eine Liste von ZTestern. Akzeptiert entweder eine Liste von ZIDs oder das vollständige ZObject für die Funktion, Implementierungen oder Tester. Akzeptiert auch einen Schlüssel, um einen Backend-Cache zu verwenden oder nicht.",
	"apihelp-wikilambda_perform_test-param-zfunction": "Die zu testende ZFunktions-ID (oder das Objekt)",
	"apihelp-wikilambda_perform_test-param-zimplementations": "Die Liste der zu testenden ZImplementierungs-IDs (oder Objekte)",
	"apihelp-wikilambda_perform_test-param-ztesters": "Die Liste der zu prüfenden ZTester-IDs (oder Objekte)",
	"apihelp-wikilambda_perform_test-param-nocache": "Ob der Cache verwendet werden soll oder nicht"
}
