{
	"@metadata": {
		"authors": [
			"Gomoko",
			"Pols12",
			"Verdy p",
			"Wladek92"
		]
	},
	"apihelp-wikilambda_fetch-summary": "Extraire le modèle JSON d’Objets Z.",
	"apihelp-wikilambda_fetch-param-zids": "Les Z-ID des Objets Z à extraire, séparés par des barres verticales.",
	"apihelp-wikilambda_fetch-param-language": "La langue dans laquelle retourner les résultats.",
	"apihelp-wikilambda_fetch-example-single": "Récupérer un unique Objet Z, Z1.",
	"apihelp-wikilambda_fetch-example-multiple": "Récupérer trois Objets Z : Z1, Z2 et Z3.",
	"apierror-wikilambda_fetch-missingzid": "Le Z-ID donné « $1 » n’existe pas sur ce wiki.",
	"apihelp-query+wikilambdasearch_labels-summary": "Ce générateur de listes de requêtes API permet de rechercher des libellés d’Objets Z dans une langue donnée. Il existe principalement pour assister le système de recherche anticipée.",
	"apihelp-query+wikilambdasearch_labels-param-search": "Le terme recherché",
	"apihelp-query+wikilambdasearch_labels-param-language": "Le code de langue MediaWiki dans laquelle rechercher.",
	"apihelp-query+wikilambdasearch_labels-param-nofallback": "S’il faut chercher seulement dans la langue donnée et pas dans ses langues de repli",
	"apihelp-query+wikilambdasearch_labels-param-exact": "Indique s’il faut rechercher uniquement les résultats exacts. Si désactivé, la valeur d’entrée sera traitée comme une recherche insensible à la casse et normalisée Unicode en ignorant les accents sur les caractères latins.",
	"apihelp-query+wikilambdasearch_labels-param-type": "Restreindre la sélection à un type donné d’Objet Z.",
	"apihelp-query+wikilambdasearch_labels-param-limit": "Le nombre maximum de résultats à renvoyer",
	"apihelp-query+wikilambda-example-simple": "Rechercher les Objets Z dont le libellé correspond à « foo » en anglais",
	"apihelp-query+wikilambda-example-nofallback": "Recherche des Objets-Z dont le libellé correspond à « foo » en français et n’accepte aucune langue de repli",
	"apihelp-query+wikilambda-example-type": "Chercher les Objets Z de type « Z4 », renvoyer les libellés anglais",
	"apihelp-query+wikilambdaload_zobjects-summary": "Rechercher des Objets-Z à partir de leur Z-ID et renvoyer leur modèle JSON complet ou filtré pour une langue donnée ou par défaut. Si un des Z-ID fournis n’existe pas dans le wiki, renverra une erreur Z5 au lieu de l’Objet-Z demandé.",
	"apihelp-query+wikilambdaload_zobjects-param-zids": "Les Z-ID d’Objet-Z à récupérer, séparés par des barres verticales.",
	"apihelp-query+wikilambdaload_zobjects-param-language": "Le code de langue MediaWiki dans lequel renvoyer tous les libellés d’Objet-Z.",
	"apihelp-query+wikilambdaload_zobjects-param-canonical": "Indique s’il faut retourner la forme canonique ou, si désactivé, la forme partiellement normalisée des Objets-Z demandés. Cette normalisation initiale exclut les Listes-Z et les Chaînes-Z monolingues ou multilingues.",
	"apihelp-query+wikilambdaload_zobjects-example-full": "Rechercher les Objets-Z Z12 et Z4 et renvoyer leur représentation JSON complète.",
	"apihelp-query+wikilambdaload_zobjects-example-language": "Rechercher les Objets-Z Z12 et Z4 et renvoyer leurs libellés filtrés dans les langues espagnol ou par défaut.",
	"apihelp-query+wikilambdaload_zobjects-example-error": "Rechercher les Objets-Z Z1 et l’inexistant Z012345789 et renvoyer leur représentation JSON complète.",
	"apihelp-query+wikilambdaload_zobjects-example-canonical": "Rechercher l’Objet-Z Z12 et retourner sa représentation canonique en JSON."
}
