{
	"@metadata": {
		"authors": [
			"Toliño"
		]
	},
	"apihelp-wikilambda_fetch-summary": "Obter o modelo JSON dos ZObjects.",
	"apihelp-wikilambda_fetch-param-zids": "Os ZID dos ZObjects a obter.",
	"apihelp-wikilambda_fetch-param-revisions": "As revisións dos ZID relevantes a obter. Se non se define, buscará as últimas revisións.",
	"apihelp-wikilambda_fetch-param-language": "A lingua na que devolver os resultados.",
	"apihelp-wikilambda_fetch-example-single": "Obter un único ZObject, Z1.",
	"apihelp-wikilambda_fetch-example-single-old": "Obter a revisión 12 dun único ZObject, Z1.",
	"apihelp-wikilambda_fetch-example-multiple": "Obter tres ZObjects: Z1, Z2 e Z3.",
	"apihelp-wikilambda_fetch-example-multiple-old": "Obter a revisión 12 do ZObject Z1, a revisión 14 do Z2 e a revisión 25 do Z3.",
	"apihelp-wikilambda_function_call-param-zobject": "ZObject para a chamada de función",
	"apihelp-wikilambda_function_call-param-bypass-cache": "Marca para ignorar a caché, que é un parámetro opcional unicamente para uso especial interno",
	"apihelp-wikilambda_function_call-example-generic-list": "Invocar unha función que devolve o primeiro elemento dunha lista dun determinado tipo",
	"apihelp-wikilambda_function_call-example-generic-pair": "Invocar unha función que devolve o segundo elemento dun Typed pair&lt;String,Typed pair&lt;String,Boolean&gt;&gt;",
	"apihelp-wikilambda_function_call-example-generic-map": "Invocar unha función que fai corresponder o elemento dun mapa xenérico nunha clave determinada cunha versión dunha cadea de texto do seu valor",
	"apihelp-wikilambda_function_call-example-user-defined-generic-type": "Xera un Z4/Type cunha función definida polo usuario e utilizar ese Z4/Type como Z1K1/Type dun ZObject",
	"apihelp-wikilambda_function_call-example-composition": "Invocar unha composición: se o primeiro argumento é \"true\", ordenar o segundo; en caso contrario, devolvelo intacto",
	"apihelp-wikilambda_function_call-example-notempty": "Invocar a función \"not empty\" como composición: devolve \"true\" se, e só se, a lista de entrada contén polo menos un elemento",
	"apihelp-wikilambda_function_call-example-map": "Invocar a función \"Map\": dada unha función e unha lista de cadeas de texto, devolve o resultado de executar a función sobre cada cadea",
	"apihelp-wikilambda_function_call-example-apply": "Invocar a función \"Apply\": dada unha función e unha cadea de texto, devolve o resultado de executar a función sobre a cadea",
	"apihelp-wikilambda_function_call-example-if": "Invocar a función integrada Z802 (If) cun predicado falso",
	"apihelp-wikilambda_function_call-example-native-js-code": "Invocar o código JavaScript escrito polo usuario",
	"apihelp-wikilambda_function_call-example-native-python-code": "Invocar o código Python 3 escrito polo usuario",
	"apihelp-wikilambda_function_call-example-user-defined-python": "Invocar a función de Python usando un tipo definido polo usuario.",
	"apihelp-wikilambda_function_call-example-user-defined-javascript": "Invocar a función de JavaScript usando un tipo definido polo usuario.",
	"apihelp-wikilambda_function_call-example-user-defined-validation": "Invocar a función de validación definida polo usuario implementada en Python.",
	"apihelp-wikilambda_function_call-example-curry": "Invocar unha función \"curry\"",
	"apihelp-wikilambda_function_call-example-socket": "Invocar unha función que utilice a reentrada para chamar de novo ao orquestrador",
	"apihelp-wikilambda_function_call-example-timeout": "Invocar unha función que intente executarse para sempre e esgote o tempo de espera no avaliador",
	"apihelp-wikilambda_function_call-example-orchestrator-timeout": "Invocar unha función que intente executarse durante demasiado tempo no orquestrador e esgote o tempo de espera",
	"apihelp-wikilambda_function_call-summary": "Invocar unha función chamando ao orquestrador de funcións",
	"apihelp-wikifunctions_run-summary": "Executar a chamada a unha función",
	"apihelp-wikifunctions_run-param-function_call": "ZObject para que se execute a chamada a unha función",
	"apihelp-wikilambda_supported_programming_languages-summary": "Recuperar as linguaxes de programación admitidas polo avaliador",
	"apihelp-query+wikilambdasearch_functions-example-renderable": "Buscar funcións que teñan algunha etiqueta que coincida coa subcadea de texto <kbd>Engl</kbd> e que sexan totalmente \"renderizables\"",
	"apihelp-query+wikilambdasearch_functions-example-io-types": "Buscar funcións que teñan dúas cadeas de texto de entrada e outra cadea de saída",
	"apihelp-query+wikilambdasearch_functions-summary": "Este xerador de listas de consultas á API permite buscar funcións facendo coincidir as etiquetas e os filtros de tipo de entrada/saída. Existe principalmente para apoiar a integración de wikifuncións na Wikipedia.",
	"apihelp-query+wikilambdasearch_functions-param-search": "O termo de procura",
	"apihelp-query+wikilambdasearch_functions-param-language": "Lingua preferida na que devolver as etiquetas de resultados. Se a lingua preferida non está dispoñible, devolverase a etiqueta da alternativa lingüística máis próxima",
	"apihelp-query+wikilambdasearch_functions-param-renderable": "Restrinxir as coincidencias a funcións que só teñen entradas e saídas \"renderizables\".\nAs entradas \"renderizables\" poden ser cadeas de texto, enumeracións, tipos que teñan unha función de lectura ou tipos de Wikidata (elementos, lexemas).\nAs saídas \"renderizables\" poden ser cadeas de texto ou calquera tipo que teña unha función de visualización. Se este parámetro se define como \"true\", ignoraranse os parámetros <var>input_type</var> e <var>output_type</var>.",
	"apihelp-query+wikilambdasearch_functions-param-input_types": "Restrinxir as coincidencias a funcións que usan polo menos os tipos de entrada indicados. Se <var>renderable</var> é <kbd>true</kbd>, ignorarase este parámetro.",
	"apihelp-query+wikilambdasearch_functions-param-output_type": "Restrinxir as coincidencias a funcións que devolven o tipo indicado. Se <var>renderable</var> é <kbd>true</kbd>, ignorarase este parámetro.",
	"apihelp-query+wikilambdasearch_functions-param-limit": "O número máximo de resultados a devolver",
	"apihelp-query+wikilambdasearch_labels-summary": "Este xerador de listas de consultas á API permite buscar etiquetas en ZObjects nunha lingua determinada. Existe principalmente para apoiar o sistema de busca anticipada.",
	"apihelp-query+wikilambdasearch_labels-param-search": "O termo de procura",
	"apihelp-query+wikilambdasearch_labels-param-language": "O código de lingua de MediaWiki no que buscar",
	"apihelp-query+wikilambdasearch_labels-param-nofallback": "Indica se hai que buscar só na lingua indicada e non nas súas alternativas lingüísticas",
	"apihelp-query+wikilambdasearch_labels-param-exact": "Indica se hai que buscar coincidencias exactas. Se está desactivada, a entrada tomarase como unha busca normalizada en Unicode, que non distingue entre maiúsculas e minúsculas, e ignoraranse os acentos dos caracteres latinos.",
	"apihelp-query+wikilambdasearch_labels-param-type": "Restrinxir as coincidencias a un tipo específico de ZObject.",
	"apihelp-query+wikilambdasearch_labels-param-return_type": "Restrinxir as coincidencias ás ZFunctions que poden devolver o tipo indicado, incluídas as que devolven un ZObject xenérico.",
	"apihelp-query+wikilambdasearch_labels-param-limit": "O número máximo de resultados a devolver",
	"apihelp-query+wikilambda-example-simple": "Buscar ZObjects cuxa etiqueta coincida con \"foo\" en inglés",
	"apihelp-query+wikilambda-example-nofallback": "Buscar ZObjects cuxa etiqueta coincida con \"foo\" en francés e non aceptes alternativas lingüísticas",
	"apihelp-query+wikilambda-example-type": "Buscar ZObjects do tipo \"Z4\" e devolver as etiquetas en inglés",
	"apihelp-query+wikilambda-example-return-type": "Buscar ZObjects de calquera tipo que resolvan no tipo de retorno \"Z40\" e devolver as etiquetas en inglés",
	"apihelp-query+wikilambda-example-type-and-return-types": "Buscar funcións que devolvan \"Z40\" ou \"Z1\" e devolver as etiquetas en inglés",
	"apihelp-query+wikilambda-example-types-and-return-type": "Buscar ZObjects de tipo \"Z4\" ou ZObjects de tipo \"Z7\" que resolvan no tipo \"Z4\"",
	"apihelp-query+wikilambdaload_zobjects-summary": "Buscar ZObjects dados os seus ZID e devolver o seu modelo JSON ao completo ou filtrados por unha determinada lingua ou alternativa lingüística. Se algún dos ZID proporcionados non existe no wiki, devolverá un erro Z5 en lugar do ZObject solicitado.",
	"apihelp-query+wikilambdaload_zobjects-param-zids": "Os ZID dos ZObjects a obter.",
	"apihelp-query+wikilambdaload_zobjects-param-revisions": "Os identificadores de revisión a buscar. Debe estar baleiro ou ser o mesmo número que o número de ZID solicitados.",
	"apihelp-query+wikilambdaload_zobjects-param-language": "O código de lingua de MediaWiki no que devolver todas as etiquetas dos ZObjects.",
	"apihelp-query+wikilambdaload_zobjects-param-canonical": "Indica se devolver a forma canónica ou, se está desactivada, a forma parcialmente normal dos ZObjects solicitados. Esta normalización parcial exclúe ZLists, ZMonolingual Strings e ZMultilingual Strings.",
	"apihelp-query+wikilambdaload_zobjects-param-get_dependencies": "Indica se devolver tamén os ZObjects que son dependencias dos ZID solicitados orixinalmente.",
	"apihelp-query+wikilambdaload_zobjects-example-full": "Buscar os ZObjects Z12 e Z4 e devolver a súa representación JSON completa.",
	"apihelp-query+wikilambdaload_zobjects-example-language": "Buscar os ZObjects Z12 e Z4 e devolver as súas etiquetas filtradas por castelán ou as alternativas lingüísticas.",
	"apihelp-query+wikilambdaload_zobjects-example-error": "Buscar os ZObjects Z1 e o inexistente Z012345789 e devolver as súas representacións JSON completas.",
	"apihelp-query+wikilambdaload_zobjects-example-canonical": "Buscar o ZObject Z12 e devolver a súa representación JSON canónica.",
	"apierror-query+wikilambdaload_zobjects-unloadable": "ZObjectStore non puido cargar a páxina de \"$1\".",
	"apierror-query+wikilambdaload_zobjects-notzobject": "ZObjectStore cargou algo que non é un ZObject para \"$1\".",
	"apihelp-wikilambda_edit-example-create": "Crear un novo ZObject do tipo Z6 co valor \"value\" e coa etiqueta \"label\"",
	"apihelp-wikilambda_edit-example-edit-incorrect": "Intento de actualizar o ZObject Z010 con datos incorrectos",
	"apihelp-wikilambda_edit-summary": "Crear ou editar un ZObject.",
	"apihelp-wikilambda_edit-param-summary": "Editar a mensaxe de resumo",
	"apihelp-wikilambda_edit-param-zid": "ZID do ZObject a editar. Se é \"null\", crearase un ZObject novo",
	"apihelp-wikilambda_edit-param-zobject": "Representación en JSON do ZObject a gardar",
	"apierror-wikilambda_function_call-client-error": "Non se puido completar a solicitude debido a un erro do cliente",
	"apierror-wikilambda_function_call-server-error": "Non se puido completar a solicitude debido a un erro do servidor",
	"apierror-wikilambda_function_call-concurrency-limit": "Tes demasiadas chamadas a funcións executándose nestes intres.",
	"apierror-wikilambda_function_call-response-malformed": "Interrompeuse a resposta da chamada á función: \"$1\".",
	"apierror-wikilambda_supported_programming_languages-not-connected": "Non se puido resolver o servidor \"$1\", probablemente porque o orquestrador non se está a executar. Consulta o ficheiro README para engadir o orquestrador á túa configuración de docker-compose.",
	"apierror-wikilambda_supported_programming_languages-concurrency-limit": "Solicitaches linguaxes de programación demasiadas veces.",
	"apihelp-query+wikilambdafn_search-summary": "Esta lista de consultas á API busca os identificadores de todos os ZObjects asociados cun identificador de ZFunction indicado",
	"apihelp-query+wikilambdafn_search-example-simple": "Buscar os identificadores de ZImplementation que estean asociados a un identificador de ZFunction indicado",
	"apihelp-query+wikilambdafn_search-param-zfunction_id": "O identificador de ZFunction a buscar",
	"apihelp-query+wikilambdafn_search-param-type": "O tipo de ZObject ao que fai referencia a ZFunction a buscar",
	"apihelp-query+wikilambdafn_search-param-limit": "O número máximo de resultados a devolver",
	"apihelp-wikilambda_perform_test-example": "Realizar probas con ZFunction, ZImplementation e ZTesters totalmente proporcionados",
	"apihelp-wikilambda_perform_test-z801": "Realizar todos os ZTesters para todas as ZImplementations da ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-z801-implementation": "Realizar todos os ZTesters para todas as ZImplementations Z901/Built-in da ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-z801-tester": "Realizar os ZTesters Z8010/Echo Tester for Strings e Z8011/Echo Tester for UTF8 Strings para todas as ZImplementations de ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-z801-implementation-and-testers": "Realizar todos os ZTesters Z8010 para a ZImplementation Z901/Built-in da ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-summary": "Extremo para consultar os resultados das probas para unha ZFunction. Acepta unha ZFunction, unha lista de ZImplementations e unha lista de ZTesters. Acepta tanto unha lista de ZID como o ZObject completo para a función, as implementacións ou os probadores. Tamén acepta unha clave para utilizar ou non unha caché de servidor.",
	"apihelp-wikilambda_perform_test-param-zfunction": "O identificador de ZFunction (ou obxecto) a probar",
	"apihelp-wikilambda_perform_test-param-zimplementations": "A lista de identificadores de ZImplementation (ou obxectos) a probar",
	"apihelp-wikilambda_perform_test-param-ztesters": "A lista de identificadores de ZTester (ou obxectos) a probar",
	"apihelp-wikilambda_perform_test-param-nocache": "Indica se utilizar a caché ou non",
	"wikilambda-restapi-disabled-repo-mode-only": "Esta API non está dispoñible agás no wiki do repositorio principal, Wikifunctions.org.",
	"wikilambda-restapi-fetch-too-many": "Solicitaches $1, que son demasiados obxectos á vez (permítese un máximo de $2)",
	"wikilambda-restapi-revision-mismatch": "Solicitaches a revisión $1 do obxecto \"$2\", que non se atopou"
}
