{
	"@metadata": {
		"authors": [
			"HanV",
			"McDutchie",
			"NthnH",
			"Siebrand"
		]
	},
	"apihelp-wikilambda_fetch-summary": "Het JSON-model van ZObjects opvragen.",
	"apihelp-wikilambda_fetch-param-zids": "De op te vragen ZObject-ZID’s.",
	"apihelp-wikilambda_fetch-param-revisions": "De versies van de op te vragen relevante ZID’s. Als dit niet is ingesteld, worden de nieuwste versies opgevraagd.",
	"apihelp-wikilambda_fetch-param-language": "De taal waarin resultaten moeten worden teruggestuurd.",
	"apihelp-wikilambda_fetch-example-single": "Vraag een enkel ZObject op, Z1.",
	"apihelp-wikilambda_fetch-example-single-old": "Vraag versie 12 op van een enkel ZObject, Z1.",
	"apihelp-wikilambda_fetch-example-multiple": "Vraag drie ZObjecten op: Z1, Z2 en Z3.",
	"apihelp-wikilambda_fetch-example-multiple-old": "Vraag versie 12 van het ZObject Z1, versie 14 van Z2 en versie 25 van Z3 op.",
	"apihelp-wikilambda_function_call-param-zobject": "ZObject voor functieaanroep",
	"apihelp-wikilambda_function_call-param-bypass-cache": "Optionele parameter voor het omzeilen van de cache, alleen voor speciaal intern gebruik",
	"apihelp-wikilambda_function_call-example-generic-list": "Een functie aanroepen die het eerste element terugstuurt van een lijst van een bepaald type",
	"apihelp-wikilambda_function_call-example-generic-pair": "Een functie aanroepen die het tweede element van een Typed pair&lt;String,Typed pair&lt;String,Boolean&gt;&gt;",
	"apihelp-wikilambda_function_call-example-generic-map": "Een functie aanroepen die, aan de hand van een sleutel, een element uit een generieke conversietabel omzet naar de tekenreeksversie van de waarde ervan",
	"apihelp-wikilambda_function_call-example-user-defined-generic-type": "Genereer een Z4/Type met een door de gebruiker gedefinieerde functie en gebruik dat Z4/Type als een Z1K1/Type van een ZObject",
	"apihelp-wikilambda_function_call-example-composition": "Een compositie aanroepen: als het eerste argument ‘true’ is, dan het tweede sorteren; zo niet, dat intact terugsturen",
	"apihelp-wikilambda_function_call-example-notempty": "De functie “not empty” als compositie aanroepen: retourneert ‘true’ dan en slechts dan als de invoerlijst ten minste één element bevat",
	"apihelp-wikilambda_function_call-example-map": "Roept de functie Map aan: retourneert, gegeven een functie en een lijst met tekenreeksen, het resultaat van het uitvoeren van de functie op elke tekenreeks",
	"apihelp-wikilambda_function_call-example-apply": "Roept de functie Apply aan: retourneert, gegeven een functie en een tekenreeks, het resultaat van het uitvoeren van de functie op de tekenreeks",
	"apihelp-wikilambda_function_call-example-if": "Roep de ingebouwde Z802 (If) aan met een vals predikaat",
	"apihelp-wikilambda_function_call-example-native-js-code": "De door de gebruiker geschreven JavaScript-code aanroepen",
	"apihelp-wikilambda_function_call-example-native-python-code": "Roept door de gebruiker geschreven Python 3-code aan",
	"apihelp-wikilambda_function_call-example-user-defined-python": "Roept de Python-functie aan met behulp van een door de gebruiker gedefinieerd type.",
	"apihelp-wikilambda_function_call-example-user-defined-javascript": "Roept de JavaScript-functie aan met een door de gebruiker gedefinieerd type.",
	"apihelp-wikilambda_function_call-example-user-defined-validation": "Roept de door de gebruiker gedefinieerde validatiefunctie aan die is geïmplementeerd in Python.",
	"apihelp-wikilambda_function_call-example-curry": "Een \"curried\"-functie aanroepen",
	"apihelp-wikilambda_function_call-example-socket": "Een functie aanroepen die gebruik maakt van \"reentrance\" om terug te schakelen naar de \"orchestrator\"",
	"apihelp-wikilambda_function_call-example-timeout": "Een functie aanroepen die eeuwig probeert te lopen, en dus door de beoordelaar wegens overschrijding van de maximumlooptijd wordt afgebroken",
	"apihelp-wikilambda_function_call-example-orchestrator-timeout": "Een functie aanroepen die te lang probeert te blijven draaien in de orchestrator, waardoor er een time-out optreedt",
	"apihelp-wikilambda_function_call-summary": "Roep een functie aan door de function-orchestrator aan te roepen",
	"apihelp-wikifunctions_run-summary": "Een functieaanroep uitvoeren",
	"apihelp-wikifunctions_run-param-function_call": "ZObject voor de uit te voeren functieaanroep",
	"apihelp-wikilambda_supported_programming_languages-summary": "De programmeertalen opvragen die door de beoordelaar worden ondersteund",
	"apihelp-query+wikilambdasearch_functions-example-renderable": "Zoeken naar functies die een label hebben dat overeenkomt met de substring <kbd>Engl</kbd> en volledig “rendeerbaar” zijn",
	"apihelp-query+wikilambdasearch_functions-example-io-types": "Zoeken naar functies die twee invoertekenreeksen hebben en een andere tekenreeks als uitvoer hebben",
	"apihelp-query+wikilambdasearch_functions-summary": "Met deze API-querylijstgenerator kunt u zoeken naar functies aan de hand van labels en invoer-/uitvoertypefilters. Dit voornamelijk ter ondersteuning van de integratie van Wikifuncties in Wikipedia.",
	"apihelp-query+wikilambdasearch_functions-param-search": "De zoekterm",
	"apihelp-query+wikilambdasearch_functions-param-language": "Voorkeurstaal om de resultaatlabels in te retourneren. Als de voorkeurstaal niet beschikbaar is, wordt in plaats daarvan het label in de dichtstbijzijnde terugvaltaal geretourneerd",
	"apihelp-query+wikilambdasearch_functions-param-renderable": "Resultaten beperken tot functies die alleen “rendeerbare” invoer en uitvoer hebben.\n“Rendeerbare” invoer kan tekenreeksen, enums of typen met een uitleesfunctie zijn.\n“Rendeerbare” uitvoer kan tekenreeksen of elk type met een weergavefunctie zijn. Als deze parameter op ‘true’ is ingesteld, worden de parameters <var>input_type</var> en <var>output_type</var> genegeerd.",
	"apihelp-query+wikilambdasearch_functions-param-input_types": "Resultaten beperken tot functies die ten minste de opgegeven invoertypen gebruiken. Als <var>renderable</var> op <kbd>true</kbd> staat, wordt deze parameter genegeerd.",
	"apihelp-query+wikilambdasearch_functions-param-output_type": "Resultaten beperken tot functies die het opgegeven type retourneren. Als <var>renderable</var> op <kbd>true</kbd> staat, wordt deze parameter genegeerd.",
	"apihelp-query+wikilambdasearch_functions-param-limit": "Het maximale aantal weer te geven resultaten.",
	"apihelp-query+wikilambdasearch_labels-summary": "Met deze API-querylijstgenerator kunt u in ZObjects zoeken naar labels in een bepaalde taal. De generator is er voornamelijk ter ondersteuning van het vooruitkijkzoeksysteem.",
	"apihelp-query+wikilambdasearch_labels-param-search": "De zoekterm",
	"apihelp-query+wikilambdasearch_labels-param-language": "De MediaWiki-code van de taal waarin moet worden gezocht",
	"apihelp-query+wikilambdasearch_labels-param-nofallback": "Of er alleen in de opgegeven taal moet worden gezocht en niet in de reservetalen",
	"apihelp-query+wikilambdasearch_labels-param-exact": "Of er naar exacte overeenkomsten moet worden gezocht. Indien uitgeschakeld, wordt de invoer opgevat als een niet-hoofdlettergevoelige, Unicode-genormaliseerde zoekopdracht waarbij accenten op Latijnse tekens worden genegeerd.",
	"apihelp-query+wikilambdasearch_labels-param-type": "Overeenkomsten beperken tot een specifiek type ZObject.",
	"apihelp-query+wikilambdasearch_labels-param-return_type": "Overeenkomsten beperken tot ZFunctions die het gegeven type kunnen retourneren, inclusief degenen die een generiek ZObject retourneren.",
	"apihelp-query+wikilambdasearch_labels-param-strict_return_type": "Het retourtype strikt beperken tot het opgegeven type, met uitzondering van het generieke ZObject.",
	"apihelp-query+wikilambdasearch_labels-param-limit": "Het maximale aantal weer te geven resultaten.",
	"apihelp-query+wikilambda-example-simple": "Zoek naar ZObjects waarvan het label overeenkomt met ‘foo’ in het Engels",
	"apihelp-query+wikilambda-example-nofallback": "Zoek naar ZObjects waarvan het label overeenkomt met ‘foo’ in het Frans en accepteer geen terugval-talen",
	"apihelp-query+wikilambda-example-type": "Zoek naar ZObjects van het type ‘Z4’, waarbij labels in het Engels worden geretourneerd",
	"apihelp-query+wikilambda-example-return-type": "Zoek naar ZObjecten van retourtype ‘Z40’ of ‘Z1’, waarbij labels in het Engels worden geretourneerd",
	"apihelp-query+wikilambda-example-strict-return-type": "Zoek naar ZObjects strikt van het retourtype ‘Z40’, waarbij labels in het Engels worden geretourneerd",
	"apihelp-query+wikilambdaload_zobjects-summary": "ZObjects zoeken op basis van hun ZID’s en hun JSON-model terugsturen, volledig of gefilterd tot een bepaalde taal of terugvaltalen. Als een van de opgegeven ZID’s niet in de wiki voorkomt, wordt er een Z5-fout geretourneerd in plaats van het gevraagde ZObject.",
	"apihelp-query+wikilambdaload_zobjects-param-zids": "De op te vragen ZObject-ZID’s.",
	"apihelp-query+wikilambdaload_zobjects-param-revisions": "De ID’s van de op te vragen versies. Moet leeg zijn of hetzelfde aantal waarden bevatten als het aantal aangevraagde ZID’s.",
	"apihelp-query+wikilambdaload_zobjects-param-language": "De MediaWiki-code van de taal waarin alle ZObject-labels moeten worden geretourneerd.",
	"apihelp-query+wikilambdaload_zobjects-param-canonical": "Of de canonieke vorm moet worden geretourneerd of, indien uitgeschakeld, de gedeeltelijk normale vorm van de gevraagde ZObjects. Deze gedeeltelijke normalisatie sluit ZLists, ZMonolingual Strings en ZMultilingual Strings uit.",
	"apihelp-query+wikilambdaload_zobjects-param-get_dependencies": "Of ook de ZObjects moeten worden geretourneerd die afhankelijk zijn van de oorspronkelijk aangevraagde ZID’s.",
	"apihelp-query+wikilambdaload_zobjects-example-full": "Zoek naar ZObjects Z12 en Z4 en retourneer hun volledige JSON-representatie.",
	"apihelp-query+wikilambdaload_zobjects-example-language": "Zoek naar ZObjects Z12 en Z4 en retourneer hun labels gefilterd tot Spaans of reservetalen.",
	"apihelp-query+wikilambdaload_zobjects-example-error": "Zoek naar ZObjects Z1 en de niet-bestaande Z012345789 en retourneer hun volledige JSON-representatie.",
	"apihelp-query+wikilambdaload_zobjects-example-canonical": "Zoek naar ZObject Z12 en retourneer de canonieke JSON-representatie.",
	"apierror-query+wikilambdaload_zobjects-unloadable": "ZObjectStore kon de pagina voor ‘$1’ niet laden.",
	"apierror-query+wikilambdaload_zobjects-notzobject": "ZObjectStore heeft een niet-ZObject geladen voor ‘$1’.",
	"apihelp-wikilambda_edit-example-create": "Een nieuw ZObject aanmaken van het type Z6, met de waarde ‘value’ en het label ‘label’",
	"apihelp-wikilambda_edit-example-edit-incorrect": "Probeer het ZObject Z010 bij te werken met onjuiste gegevens",
	"apihelp-wikilambda_edit-summary": "Een ZObject aanmaken of bewerken.",
	"apihelp-wikilambda_edit-param-summary": "Bericht voor bewerkingssamenvatting",
	"apihelp-wikilambda_edit-param-zid": "ZID van het te bewerken ZObject. Bij weglating wordt een nieuw ZObject aangemaakt.",
	"apihelp-wikilambda_edit-param-zobject": "JSON-weergave van het ZObject dat moet worden opgeslagen",
	"apierror-wikilambda_function_call-not-connected": "Kan host ‘$1’ niet opzoeken, waarschijnlijk omdat de Orchestrator niet actief is. Raadpleeg de README om de Orchestrator toe te voegen aan uw docker-compose-configuratie.",
	"apierror-wikilambda_function_call-concurrency-limit": "Er worden momenteel te veel functieaanroepen uitgevoerd.",
	"apierror-wikilambda_function_call-response-malformed": "Fout in antwoord op functieaanroep: ‘$1’.",
	"apierror-wikilambda_supported_programming_languages-not-connected": "Kan host ‘$1’ niet opzoeken, waarschijnlijk omdat de Orchestrator niet actief is. Raadpleeg de README om de Orchestrator toe te voegen aan uw docker-compose-configuratie.",
	"apierror-wikilambda_supported_programming_languages-concurrency-limit": "U hebt te vaak programmeertalen aangevraagd.",
	"apihelp-query+wikilambdafn_search-summary": "Deze API-querylijst zoekt naar de ID’s van alle ZObjects die zijn gekoppeld aan een opgegeven ZFunction-ID",
	"apihelp-query+wikilambdafn_search-example-simple": "Zoek naar ZImplementation-ID’s die zijn gekoppeld aan een bepaalde ZFunction-ID",
	"apihelp-query+wikilambdafn_search-param-zfunction_id": "De ZFunction-ID waarnaar moet worden gezocht",
	"apihelp-query+wikilambdafn_search-param-type": "Het type ZObject waarnaar wordt verwezen door de te zoeken ZFunction",
	"apihelp-query+wikilambdafn_search-param-limit": "Het maximale aantal weer te geven resultaten.",
	"apihelp-wikilambda_perform_test-example": "Voer tests uit op een volledig opgegeven ZFunction, ZImplementation en ZTesters",
	"apihelp-wikilambda_perform_test-z801": "Voer alle ZTesters uit voor alle ZImplementaties van ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-z801-implementation": "Voer alle ZTesters uit voor ZImplementatie Z901/ingebouwd in ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-z801-tester": "Voer ZTesters Z8010/Echo Tester voor Strings en Z8011/Echo Tester voor UTF8 Strings uit voor alle ZImplementaties van ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-z801-implementation-and-testers": "Voer alle ZTester Z8010 uit voor ZImplementatie Z901/ingebouwd in ZFunction Z801/Echo",
	"apihelp-wikilambda_perform_test-summary": "Eindpunt voor het opvragen van testresultaten voor een ZFunction. Accepteert een ZFunction, een lijst met ZImplementaties en een lijst met ZTesters. Accepteert een lijst met ZID’s of het volledige ZObject voor de functie, implementaties of testers. Accepteert ook een sleutel om al dan niet een back-end cache te gebruiken.",
	"apihelp-wikilambda_perform_test-param-zfunction": "De ZFunction-ID die (of het object dat) moet worden getest",
	"apihelp-wikilambda_perform_test-param-zimplementations": "De lijst met te testen ZImplementatie-ID’s (of objecten)",
	"apihelp-wikilambda_perform_test-param-ztesters": "De lijst met te testen ZTester-ID’s (of objecten)",
	"apihelp-wikilambda_perform_test-param-nocache": "Of de cache gebruikt moet worden of niet",
	"wikilambda-restapi-fetch-too-many": "U hebt $1 objecten aangevraagd, wat er te veel tegelijk zijn (maximaal $2 toegestaan)",
	"wikilambda-restapi-revision-mismatch": "U heeft versie $1 van object ‘$2’ aangevraagd, maar deze is niet gevonden"
}
