{
	"@metadata": {
		"authors": [
			"B3rnas",
			"Hamilton Abreu"
		]
	},
	"apihelp-wikilambda_fetch-summary": "Obter o modelo JSON de Objetos-Z.",
	"apihelp-wikilambda_fetch-param-zids": "Os Identificadores-Z de Objetos-Z a serem obtidos.",
	"apihelp-wikilambda_fetch-param-revisions": "As revisões dos Identificadores-Z relevantes a serem obtidos. Se o parâmetro não estiver definido, serão obtidas as revisões mais recentes.",
	"apihelp-wikilambda_fetch-param-language": "A língua na qual os resultados serão devolvidos.",
	"apihelp-wikilambda_fetch-example-single": "Obter um único Objeto-Z, Z1.",
	"apihelp-wikilambda_fetch-example-single-old": "Obter a revisão 12 de um único Objeto-Z, Z1.",
	"apihelp-wikilambda_fetch-example-multiple": "Obter três Objetos-Z: Z1, Z2 e Z3.",
	"apihelp-wikilambda_fetch-example-multiple-old": "Obter a revisão 12 do Objeto-Z Z1, a revisão 14 do Z2 e a revisão 25 do Z3.",
	"apihelp-wikilambda_function_call-param-zobject": "Objeto-Z para a chamada de função",
	"apihelp-wikilambda_function_call-example-generic-list": "Invocar uma função que devolve o primeiro elemento de uma lista de tipo determinado",
	"apihelp-wikilambda_function_call-example-generic-pair": "Invoca uma função que devolve o segundo elemento de um Typed pair&lt;String,Typed pair&lt;String,Boolean&gt;&gt;",
	"apihelp-wikilambda_function_call-example-generic-map": "Invoca uma função que mapeia o elemento de um mapa genérico numa dada chave para uma versão em texto do seu valor",
	"apihelp-wikilambda_function_call-example-user-defined-generic-type": "Gerar um Z4/Tipo com uma função definida pelo utilizador e usar esse Z4/Tipo como o Z1K1/Tipo de um Objeto-Z",
	"apihelp-wikilambda_function_call-example-composition": "Invocar uma composição: se o primeiro argumento for verdadeiro, ordenar o segundo; caso contrário, devolvê-lo intacto",
	"apihelp-wikilambda_function_call-example-notempty": "Invocar a função \"not empty\" (não vazio) como uma composição: devolve o valor verdadeiro se, e só se, a lista de entrada contém pelo menos um elemento",
	"apihelp-wikilambda_function_call-example-map": "Invocar a função Map (mapear): dada uma função e uma lista de textos, devolver o resultado da execução da função sobre cada texto",
	"apihelp-wikilambda_function_call-example-apply": "Invocar a função Apply (aplicar): dada uma função e um texto, devolve o resultado da execução da função sobre o texto",
	"apihelp-wikilambda_function_call-example-if": "Invocar a função integrada Z802 (If, se) com um predicado falso",
	"apihelp-wikilambda_function_call-example-native-js-code": "Invocar código JavaScript escrito pelo utilizador",
	"apihelp-wikilambda_function_call-example-native-python-code": "Invocar código Python 3 escrito pelo utilizador",
	"apihelp-wikilambda_function_call-example-user-defined-python": "Invocar função Python usando um tipo definido pelo utilizador.",
	"apihelp-wikilambda_function_call-example-user-defined-javascript": "Invocar função JavaScript usando um tipo definido pelo utilizaor.",
	"apihelp-wikilambda_function_call-example-user-defined-validation": "Invocar uma função de validação definida pelo utilizador e implementada em Python.",
	"apihelp-wikilambda_function_call-example-curry": "Chamar uma função com ''currying''",
	"apihelp-wikilambda_function_call-example-socket": "Chamar uma função que usa reentrada para chamar de volta o orquestrador",
	"apihelp-wikilambda_function_call-example-timeout": "Chamar uma função que tenta correr para sempre e, portanto, ultrapassa o tempo limite no avaliador",
	"apihelp-wikilambda_function_call-example-orchestrator-timeout": "Chamar uma função que tenta correr durante demasiado tempo no orquestrador e, portanto, ultrapassa o tempo limite",
	"apihelp-wikilambda_function_call-summary": "Invocar uma função chamando o orquestrador de funções",
	"apihelp-wikilambda_supported_programming_languages-summary": "Obter as linguagens de programação suportadas pelo avaliador",
	"apihelp-query+wikilambdasearch_labels-summary": "Esta consulta geradora de listas, da API, permite pesquisar nos Objetos-Z as etiquetas de uma determinada língua. Ela existe sobretudo para apoiar o sistema de antecipação de pesquisa.",
	"apihelp-query+wikilambdasearch_labels-param-search": "O termo de pesquisa",
	"apihelp-query+wikilambdasearch_labels-param-language": "O código de língua do MediaWiki no qual pesquisar",
	"apihelp-query+wikilambdasearch_labels-param-nofallback": "Se a pesquisa deve ser feita apenas na língua especificada e não nas línguas de recurso",
	"apihelp-query+wikilambdasearch_labels-param-exact": "Se a pesquisa deve procurar correspondências exatas. Se desativada, a entrada será considerada como uma pesquisa normalizada para Unicode, sem distinção entre maiúsculas e minúsculas, e ignorando os acentos nos caracteres do alfabeto latino.",
	"apihelp-query+wikilambdasearch_labels-param-type": "Restringir as correspondências a um tipo específico de Objeto-Z.",
	"apihelp-query+wikilambdasearch_labels-param-return_type": "Restringir as correspondências a Funções-Z que podem devolver o tipo fornecido, incluindo aquelas que devolvem um Objeto-Z genérico.",
	"apihelp-query+wikilambdasearch_labels-param-strict_return_type": "Restringir o tipo do resultado para ser unicamente o especificado, excluindo o Objeto-Z genérico.",
	"apihelp-query+wikilambdasearch_labels-param-limit": "O número máximo de resultados a serem devolvidos",
	"apihelp-query+wikilambda-example-simple": "Procurar Objetos-Z cuja etiqueta corresponda a 'foo' em inglês",
	"apihelp-query+wikilambda-example-nofallback": "Procurar Objetos-Z cuja etiqueta corresponda a 'foo' em francês e não aceitar línguas de recurso",
	"apihelp-query+wikilambda-example-type": "Procurar Objetos-Z do tipo 'Z4' e devolver etiquetas em inglês",
	"apihelp-query+wikilambda-example-return-type": "Procurar Objetos-Z com resultado do tipo 'Z40' ou 'Z1' e devolver etiquetas em inglês",
	"apihelp-query+wikilambda-example-strict-return-type": "Procurar Objetos-Z com resultado unicamente do tipo 'Z40' e devolver etiquetas em inglês",
	"apihelp-query+wikilambdaload_zobjects-summary": "Procurar Objetos-Z com base nos Identificadores-Z fornecidos e devolver o respetivo modelo JSON completo ou filtrado para uma determinada língua e respetivas línguas de recurso. Se algum dos Identificadores-Z fornecidos não existir na wiki, devolverá um erro Z5 em vez do Objeto-Z pedido.",
	"apihelp-query+wikilambdaload_zobjects-param-zids": "Os Identificadores-Z do Objeto-Z a serem obtidos.",
	"apihelp-query+wikilambdaload_zobjects-param-revisions": "Os identificadores das revisões a obter. Tem de estar vazio ou ser o mesmo número que o número de ZID pedidos.",
	"apihelp-query+wikilambdaload_zobjects-param-language": "O código de língua do MediaWiki no qual devolver todas as etiquetas do Objeto-Z.",
	"apihelp-query+wikilambdaload_zobjects-param-canonical": "Se deve ser devolvida a forma canónica ou, se desativado, a forma parcialmente normal dos Objetos-Z pedidos. Esta normalização parcial exclui Listas-Z, Textos Monolíngua-Z e Textos Multilínguas-Z.",
	"apihelp-query+wikilambdaload_zobjects-example-full": "Procurar os Objetos-Z Z12 e Z4 e devolver a sua representação JSON completa.",
	"apihelp-query+wikilambdaload_zobjects-example-language": "Procurar os Objetos-Z Z12 e Z4 e devolver as suas etiquetas filtradas para espanhol ou respetivas línguas de recurso.",
	"apihelp-query+wikilambdaload_zobjects-example-error": "Procurar os Objetos-Z Z1 e o inexistente Z012345789 e devolver a sua representação JSON completa.",
	"apihelp-query+wikilambdaload_zobjects-example-canonical": "Procurar o Objeto-Z Z12 e devolver a sua representação JSON canónica.",
	"apierror-query+wikilambdaload_zobjects-unloadable": "O Repositório de Objetos-Z não conseguiu carregar a página para '$1'.",
	"apierror-query+wikilambdaload_zobjects-notzobject": "O Repositório de Objetos-Z carregou algo que não é um Objeto-Z para '$1'.",
	"apihelp-wikilambda_edit-example-create": "Criar um Objeto-Z novo, de tipo Z6, com o valor 'value' (valor) e etiquetado 'label' (etiqueta)",
	"apihelp-wikilambda_edit-example-edit-incorrect": "Tentar atualizar o Objeto-Z Z010 com um dado incorreto",
	"apihelp-wikilambda_edit-summary": "Criar ou editar um Objeto-Z.",
	"apihelp-wikilambda_edit-param-summary": "Editar mensagem de resumo",
	"apihelp-wikilambda_edit-param-zid": "O Identificador-Z do Objeto-Z a ser editado. Se nulo, será criado um Objeto-Z novo",
	"apihelp-wikilambda_edit-param-zobject": "Representação JSON do Objeto-Z a gravar",
	"apierror-wikilambda_function_call-not-connected": "Não foi possível resolver o servidor '$1', provavelmente porque o orquestrador não está a ser executado. Consulte o README para adicionar o orquestrador à sua configuração \"docker-compose\".",
	"apierror-wikilambda_function_call-concurrency-limit": "Tem demasiadas chamadas de funções em execução neste momento.",
	"apihelp-query+wikilambdafn_search-summary": "Esta consulta da API procura os identificadores de todos os Objetos-Z associados ao identificador de uma Função-Z que for especificado",
	"apihelp-query+wikilambdafn_search-example-simple": "Procurar identificadores de Implementações-Z que estão associados ao identificador de uma Função-Z que for especificado",
	"apihelp-query+wikilambdafn_search-param-zfunction_id": "O identificador da Função-Z a pesquisar",
	"apihelp-query+wikilambdafn_search-param-type": "O tipo de Objeto-Z referenciado pela Função-Z a pesquisar",
	"apihelp-wikilambda_perform_test-example": "Realizar testes contra uma Função-Z, Implementação-Z e Testadores-Z totalmente fornecidos",
	"apihelp-wikilambda_perform_test-summary": "Ponto de terminação para consultar os resultados dos testes de uma Função-Z. Aceita uma Função-Z, uma lista de Implementações-Z e uma lista de Testadores-Z. Aceita uma lista de Identificadores-Z ou o Objeto-Z completo para a função, implementações e testadores. Também aceita uma chave para utilizar ou não uma cache no servidor.",
	"apihelp-wikilambda_perform_test-param-zfunction": "O identificador da Função-Z (ou objeto) a testar",
	"apihelp-wikilambda_perform_test-param-zimplementations": "A lista de identificadores de Implementações-Z (ou objetos) a testar",
	"apihelp-wikilambda_perform_test-param-ztesters": "A lista de identificadores de Testadores-Z (ou objetos) para os testes",
	"apihelp-wikilambda_perform_test-param-nocache": "Se deve, ou não, ser usada a cache"
}
