{
	"@metadata": {
		"authors": [
			"Amire80",
			"Genoveva Galarza",
			"James D. Forrester"
		]
	},
	"wikilambda-fragment-disabled": "Message shown in article contents where a Wikifunctions call has been made but the system is offline.",
	"wikilambda-fragment-pending": "Message shown in article contents where a Wikifunctions call has been made and the output is not yet available. Refreshing the page will generally make it available.",
	"wikilambda-recentchanges-edit-legend": "The label to show in the recent changes list legend to explain that this indicates an edit from Wikifunctions",
	"wikilambda-recentchanges-edit-letter": "The letter to show in the recent changes list for an edit from Wikifunctions. Short form of \"Function\".\n\n{{Rc single letters}}\n\nSee also:\n* {{msg-mw|Wikilambda-recentchanges-edit-title}}\n* {{msg-mw|Wikilambda-recentchanges-edit-legend}}",
	"wikilambda-recentchanges-edit-title": "The label for the tool-tip over the letter that indicates in recent changes that an edit is from Wikifunctions",
	"wikilambda-recentchanges-entry-function": "The label for the link to the Function that was edited in the recent changes list, followed by a colon and then the name of the Function. This should probably be the same as {{msg-mw|wikilambda-visualeditor-wikifunctionscall-title}}",
	"wikilambda-recentchanges-explanation-connect-implementation": "Message used in recent changes to describe the change made on Wikifunctions, that one or more Implementations have been connected.\n\nParameters:\n* $1: The number of Implementations connected\n* $2: The list of Implementations connected (e.g. 'Z12345' or 'Z12345, Z12346, and Z12347')",
	"wikilambda-recentchanges-explanation-connect-tester": "Message used in recent changes to describe the change made on Wikifunctions, that one or more Test cases have been connected.\n\nParameters:\n* $1: The number of Test cases connected\n* $2: The list of Test cases connected (e.g. 'Z12345' or 'Z12345, Z12346, and Z12347')",
	"wikilambda-recentchanges-explanation-delete-function": "Message used in recent changes to describe the change made on Wikifunctions, that the definition of the Function was deleted. If a log entry was written in the deletion, it will follow this message after a {{msg-mw|colon-separator}}.",
	"wikilambda-recentchanges-explanation-delete-implementation": "Message used in recent changes to describe the change made on Wikifunctions, that an Implementation of the Function was deleted. If a log entry was written in the deletion, it will follow this message after a {{msg-mw|colon-separator}}.\n\nParameters:\n* $1: The ZID of the deleted Implementation, e.g. 'Z12345'.",
	"wikilambda-recentchanges-explanation-delete-tester": "Message used in recent changes to describe the change made on Wikifunctions, that a Test case of the Function was deleted. If a log entry was written in the deletion, it will follow this message after a {{msg-mw|colon-separator}}.\n\nParameters:\n* $1: The ZID of the deleted Test case, e.g. 'Z12345'.",
	"wikilambda-recentchanges-explanation-disconnect-implementation": "Message used in recent changes to describe the change made on Wikifunctions, that one or more Implementations have been connected.\n\nParameters:\n* $1: The number of Implementations disconnected\n* $2: The list of Implementations disconnected (e.g. 'Z12345' or 'Z12345, Z12346, and Z12347')",
	"wikilambda-recentchanges-explanation-disconnect-tester": "Message used in recent changes to describe the change made on Wikifunctions, that one or more Test cases have been connected.\n\nParameters:\n* $1: The number of Test cases disconnected\n* $2: The list of Test cases disconnected (e.g. 'Z12345' or 'Z12345, Z12346, and Z12347')",
	"wikilambda-recentchanges-explanation-edit-function": "Message used in recent changes to describe the change made on Wikifunctions, that the definition of the Function was changed. If an edit summary was used in the edit, it will follow this message after a {{msg-mw|colon-separator}}.",
	"wikilambda-recentchanges-explanation-edit-implementation": "Message used in recent changes to describe the change made on Wikifunctions, that an Implementation of the Function was changed. If an edit summary was used in the edit, it will follow this message after a {{msg-mw|colon-separator}}.\n\nParameters:\n* $1: The ZID of the edited Implementation, e.g. 'Z12345'.",
	"wikilambda-recentchanges-explanation-edit-tester": "Message used in recent changes to describe the change made on Wikifunctions, that a Test case of the Function was changed. If an edit summary was used in the edit, it will follow this message after a {{msg-mw|colon-separator}}.\n\nParameters:\n* $1: The ZID of the edited Test case, e.g. 'Z12345'.",
	"wikilambda-recentchanges-explanation-restore-function": "Message used in recent changes to describe the change made on Wikifunctions, that the definition of the Function was undeleted. If a log entry was written in the deletion, it will follow this message after a {{msg-mw|colon-separator}}.",
	"wikilambda-recentchanges-explanation-restore-implementation": "Message used in recent changes to describe the change made on Wikifunctions, that an Implementation of the Function was restored (undeleted). If a log entry was written in the undeletion, it will follow this message after a {{msg-mw|colon-separator}}.\n\nParameters:\n* $1: The ZID of the deleted Implementation, e.g. 'Z12345'.",
	"wikilambda-recentchanges-explanation-restore-tester": "Message used in recent changes to describe the change made on Wikifunctions, that a Test case of the Function was restored (undeleted). If a log entry was written in the undeletion, it will follow this message after a {{msg-mw|colon-separator}}.\n\nParameters:\n* $1: The ZID of the restored Test case, e.g. 'Z12345'.",
	"wikilambda-recentchanges-filter-description": "The explaination of what edits are included in the filter for Wikifunctions edits",
	"wikilambda-recentchanges-filter-label": "The label in the recent changes filter system to let you filter in or out these edits from being displayed",
	"wikilambda-recentchanges-filter-rc-pref": "The label for the preference to enable Wikifunctions edits to be shown in the recent changes list. Comparable to {{msg-mw|wikibase-rc-show-wikidata-pref}}",
	"wikilambda-recentchanges-filter-wl-pref": "The label for the preference to enable Wikifunctions edits to be shown in your watchlist. Comparable to {{msg-mw|wikibase-watchlist-show-changes-pref}}",
	"wikilambda-visualeditor-wikifunctionscall-ce-abort": "Label shown in the visual editor instead of the result when editing a Wikifunctions call and the loading took too long.",
	"wikilambda-visualeditor-wikifunctionscall-ce-loading": "Label shown in the visual editor instead of the result when editing a Wikifunctions call while the call is being loaded.",
	"wikilambda-visualeditor-wikifunctionscall-dialog-enum-selector-placeholder": "Placeholder for the enum select field in the Wikifunctions call input configuration dialog in the visual editor",
	"wikilambda-visualeditor-wikifunctionscall-dialog-function-link-footer": "Footer text below the Wikifunctions input configuration dialog, which links to the selected Function page in Wikifunctions.\n\nParameters:\n* $1: The Function ID, e.g. 'Z12345'",
	"wikilambda-visualeditor-wikifunctionscall-dialog-read-less-description": "Label for the 'Read less' button in the visual editor to collapse a description",
	"wikilambda-visualeditor-wikifunctionscall-dialog-read-more-description": "Label for the 'Read more' button in the visual editor to expand a description",
	"wikilambda-visualeditor-wikifunctionscall-dialog-search-no-results": "Message to show when the Function search in the Wikifunctions insert dialog in the visual editor rendered no results",
	"wikilambda-visualeditor-wikifunctionscall-dialog-search-placeholder": "Placeholder for the Function search field in the Wikifunctions insert dialog in the visual editor",
	"wikilambda-visualeditor-wikifunctionscall-dialog-search-results-title": "Title of the search results section in the Wikifunctions insert dialog in the visual editor",
	"wikilambda-visualeditor-wikifunctionscall-dialog-string-input-placeholder": "Placeholder for the string input field in the Wikifunctions call input configuration dialog in the visual editor",
	"wikilambda-visualeditor-wikifunctionscall-dialog-suggested-functions-title": "Title of the suggested functions section in the Wikifunctions insert dialog in the visual editor",
	"wikilambda-visualeditor-wikifunctionscall-error-bad-function": "Error message to show in the Wikifunctions call popup in the visual editor when the function ID is missing or invalid.",
	"wikilambda-visualeditor-wikifunctionscall-error-enum": "Error message to show in the Wikifunctions call input configuration dialog in the visual editor when the enum field is not valid.",
	"wikilambda-visualeditor-wikifunctionscall-error-parser": "Error message to show in the Wikifunctions call input configuration dialog in the visual editor when the reading function fails.",
	"wikilambda-visualeditor-wikifunctionscall-info-missing-content": "Message for the notice box to show in the Wikifunctions call input configuration dialog when the selected function has any content missing for the user language.\n\nParameters:\n* $1: The Function ID, e.g. Z12345",
	"wikilambda-visualeditor-wikifunctionscall-no-description": "Placeholder for the function description when there is no description available in any language.",
	"wikilambda-visualeditor-wikifunctionscall-no-input-label": "Placeholder for the function input label when there is no label available in any language.",
	"wikilambda-visualeditor-wikifunctionscall-no-name": "Placeholder for the function name when there is no label available in any language.",
	"wikilambda-visualeditor-wikifunctionscall-popup-loading": "Label for the progress indicator component rendered in the Wikifunctions call popup in the visual while the Function data is being fetched",
	"wikilambda-visualeditor-wikifunctionscall-popup-no-function": "Message to show as body in the Wikifunctions call popup in the visual editor, when there is no function selected",
	"wikilambda-visualeditor-wikifunctionscall-title": "Title for the Wikifunctions call dialog in the visual editor, shown as a heading label above the call content"
}
